# BsonExpression Unit Test
#   "{" new document to be used in next tests
#	">" indicate new expression to test
#   "~" expected expression formatted
#   "=" expected result (support multilines per test)

# Expression format
> _id
~ $._id
> a.b
~ $.a.b
> a[ *].['c'] + 5
~ $.a[*].c+5
> a[ @ + 1 = @ + 2].b  = 9
~ $.a[@+1=@+2].b=9
> a.['a-b']
~ $.a.["a-b"]
> 'single "quote\' string'
~ "single \"quote' string"
> "double 'quote\" string"
~ "double 'quote\" string"
> {'a-b':1, "x+1": 2, 'y': 3}
~ {"a-b":1,"x+1":2,y:3}
> [1, 2 ,  { $guid : "826944a6-72ec-4fc0-a1bc-9fd9f846c266" }]
> [1,2,{$guid:"826944a6-72ec-4fc0-a1bc-9fd9f846c266"}]